Reebok-bat  number of item is: 12 willow selected is: english of  medium size. Total billing amount is:192000 at 2021-09-06 00:18:58.886639
SG-bat  number of item is: 6 willow selected is: kashmir of  fullsize. Total billing amount is:54000 at 2021-09-06 01:02:38.563014
Gray-Nicholis-bat  number of item is: 20 willow selected is: english of  medium size. Total billing amount is:340000 at 2021-09-06 01:09:49.071768
Gray-Nicholis-bat  number of item is: 20 willow selected is: english of  medium size. Total billing amount is:340000 at 2021-09-06 01:09:49.071768
Addidas-bat  number of item is: 21 willow selected is: english of  medium size. Total billing amount is:336000 at 2021-09-06 01:14:13.083863
Kookabura-bat  number of item is: 8 willow selected is: kashmir of  small size. Total billing amount is:88000 at 2021-09-06 01:17:51.287010
Reebok-bat  number of item is: 12 willow selected is: english of  smallsize. Total billing amount is:108000 at 2021-09-06 01:20:05.285808
GM-bat  number of item is: 10 willow selected is: kashmir of  fullsize. Total billing amount is:160000 at 2021-09-06 01:21:21.054656
GM-bat  number of item is: 10 willow selected is: kashmir of  fullsize. Total billing amount is:160000 at 2021-09-06 01:21:21.054656
New-Balance-bat  number of item is: 47 willow selected is: english of  full size. Total billing amount is:1081000 at 2021-09-06 01:24:38.422062
New-Balance-bat  number of item is: 47 willow selected is: english of  full size. Total billing amount is:1081000 at 2021-09-06 01:24:38.422062
Spartan-bat  number of item is: 27 willow selected is: english of  full size. Total billing amount is:567000 at 2021-09-06 01:26:26.372310
SG-bat  number of item is: 23 willow selected is: english of  full size. Total billing amount is:437000 at 2021-09-06 01:36:58.641954
New-Balance-bat  number of item is: 12 willow selected is: kashmir of  full size. Total billing amount is:192000 at 2021-09-06 17:44:22.261884
Addidas-bat  number of item is: 23 willow selected is: english of  small size. Total billing amount is:368000 at 2021-09-06 17:45:49.029729
GM-bat  number of item is: 10 willow selected is: kashmir of  full size. Total billing amount is:160000 at 2021-09-06 17:47:11.428489
GM-bat  number of item is: 23 willow selected is: english of  full size. Total billing amount is:503700 at 2021-09-06 17:54:40.057153
kookabura-bat  number of item is: 32 willow selected is: english of  full size. Total billing amount is:736000 at 2021-09-06 17:56:48.181290
